<?php
return [
    //控制器白名单
    'action_white_list' => [
        '/system/user' => ['profile', 'change-password', 'change-profile'],
        '/erp/bus-order' => ['get-info']
    ],
    'bill_order_type' => [
        '2' => '取货订单',
        '1' => '送货订单',
    ],
    'order_status_list' => [
        '1' => '待指派',
        '2' => '等待司机绑定',
        '3' => '等待开始行程',
        '4' => '配送中',
        '5' => '已签收',
        '6' => '已完成',
    ],
    'package_status_list' => [
        '1' => '用户待付款',
        '2' => '服务站待发货',
        '3' => '已绑定包裹码',
        '4' => '生成取货订单',
        '5' => '司机已拿货',
        '6' => '到总站',
        '7' => '生成发货订单',
        '8' => '配送中',
        '9' => '服务站已签收',
        '10' => '已完成',
    ],
    'bus_add_type_list' => [
        '1' => '自动',
        '2' => '手动'
    ],
    'verify_status_list' => [
        '0' => '未认证',
        '1' => '认证中',
        '2' => '已认证',
        '3' => '认证失败'
    ],
    'pay_method_list' => [
        '1' => '微信',
        '2' => '支付宝'
    ],
    'customer_type_list' => [
        '1' => '司机',
        '2' => '会员',
        '3' => '服务站人员'
    ],
    'seat_type_list' => [
        '1' => '5座',
        '2' => '7座',
        '3' => '7座以上'
    ],
    'message_type_list' => [
        '1' => '个人',
        '2' => '全体用户',
        '3' => '所有司机',
        '4' => '所有站点',
        '5' => '所有会员',
    ],
    'message_status_list' => [
        '0' => '已删除',
        '1' => '未推送',
        '2' => '已推送',
        '3' => '推送失败',
    ],
    'driving_license_list' => [
        'A1' => 'A1',
        'A2' => 'A2',
        'A3' => 'A3',
        'B1' => 'B1',
        'B2' => 'B2',
        'C1' => 'C1',
        'C2' => 'C2',
        'C3' => 'C3',
        'C4' => 'C4',
        'C5' => 'C5',
        'D' => 'D',
        'E' => 'E',
        'F' => 'F',
        'M' => 'M',
        'N' => 'N',
        'P' => 'P',
    ],
    'bus_type' => [
        '1' => '上行',
        '2' => '下行',
    ],
    'is_print' => [
        '0' => '未打印',
        '1' => '已打印',
    ],
    'station_bill_status' => [
        '0' => '未审核',
        '1' => '已审核',
    ],
    'car_type' => [
        '1' => '小巴士',
        '2' => '中巴士',
        '3' => '大巴士',
    ],
    'driver_accept_type'=>[
        0 => '等待接受',
        1=> '接受',
        2 => '拒绝'
    ],
];
