<?php
return [
    'adminEmail' => 'admin@example.com',
    'supportEmail' => 'support@example.com',
    'user.passwordResetTokenExpire' => 3600,
    'car_type_list' => [
        '1' => '小巴车',
        '2' => '中巴车',
        '3' => '大巴车'
    ],
    'bus_order_status_list' => [
        '0' => '已取消',
        '1' => '待付款',//会员户待付款
        '2' => '待指派',//会员付款完成后，等待后台指派订单给司机
        '3' => '待接单',//后台订单指派给司机，等待司机接单
        '4' => '拒绝接单',//司机拒绝接单，等待重新派单
        '5' => '待确认',//司机接单，等待扫码确认
        '6' => '已绑定',//司机扫码确认
        '7' => '出行中',//出行中
        '8' => '已完成',
        '9' => '待退款'
    ],
    'bus_order_type_list' => [
        '1' => '旅游包车',
        '2' => '站点叫车',
        '3' => '定制班车'
    ],
    'bill_type_list' => [
        '1' => '旅游包车',
        '2' => '站点叫车',
        '3' => '定制班车',
        '4' => '送包裹'
    ],
    //公交站点类型
    'trace_type' => [
        '1' => '上行',
        '2' => '下行',
    ],
    'order_type' => [
        '1' => '发货订单',
        '2' => '取货订单'
    ],
    'order_status' => [
        'pending' => 1,//待指派
        'wait_send' => 2,//待配送
        'wait_bind' => 3,//配送中  司机到总站 扫码 绑定后的
        'sending' => 4,//配送中   司机 点击开始行程的
        'arrive' => 5,//已签收 服务站  服务站扫描二维码
        'complete' => 6,//订单完成  所有的包裹都被用户收了之后
    ],
    'package_status' => [
        'unpay' => 1,//待付款
        'wait' => 2,//待发货
        'wait_after_bind' => 3,//贴了标签的待发货
        'wait_get' => 4,//生成取货订单的 订单的待发货
        'arrive_to_get' => 5,//司机到达服务站 服务站扫码 然后让司机拿货
        'wait_arrive_center' => 6,//到达总站的待发货
        'wait_generate' => 7,//生成送货 订单的待发货
        'sending' => 8,//配送中
        'arrive' => 9,//已签收  服务站已签收
        'complete' => 10,//已完成用户取货
    ],
    'money' => [
        '1' => 3,
        '2' => 5,
        '3' => 6
    ],
    'order_source' => [
        '1' => '手动录入',
        '2' => '站点提交',
    ],
    'weight' => ['1' => "0-10kg", '2' => "11-15kg", '3' => "16-20kg"],
    'size' => ['1' => " ≤0.03m³", '2' => " ≤0.045m³", '3' => " ≤0.06m³"],
    'distance' => ['1' => "15km", '2' => "16-50km", '3' => "51㎞以上"],
];
