<?php
return [
    'adminEmail' => 'admin@example.com',
    //不需要登录白名单
    'action_white_list' => [
        'v1/public' => ['*'],
        'app-api/common' => ['*'],
        'v1/pay' => ['*'],
        'v1/test' => ['*'],
        'v1/service-station' => ['*'],
        'v1/order' => ['generate', 'assign']
    ],
    'bus_order_status_list_customer' => [
        '0' => '已取消',
        '1' => '待付款',//会员户待付款
        '2' => '已支付',//会员付款完成后，等待后台指派订单给司机
        '3' => '已支付',//后台订单指派给司机，等待司机接单
        '4' => '已支付',//司机拒绝接单，等待重新派单
        '5' => '已接单',//司机接单，等待扫码确认
        '6' => '出行中',//司机扫码确认
        '7' => '出行中',//出行中
        '8' => '已完成',
        '9' => '待退款'
    ],
    'bus_order_status_list_driver' => [
        '0' => '已取消',
        '1' => '待付款',//会员户待付款
        '2' => '已支付',//会员付款完成后，等待后台指派订单给司机
        '3' => '待接单',//后台订单指派给司机，等待司机接单
        '4' => '拒绝接单',//司机拒绝接单，等待重新派单
        '5' => '已接单',//司机接单，等待扫码确认
        '6' => '已确认',//司机扫码确认
        '7' => '出行中',//出行中
        '8' => '已完成',
        '9' => '待退款'
    ],
];
